---
kind: property
id: P:Autodesk.Revit.DB.BarTypeDiameterOptions.StandardBendDiameter
source: html/72692d95-b786-ebdb-0c44-bfde76949046.htm
---
# Autodesk.Revit.DB.BarTypeDiameterOptions.StandardBendDiameter Property

Represents the standard bar bend diameter of the RebarBarType.

## Syntax (C#)
```csharp
public double StandardBendDiameter { get; set; }
```